def number_to_words(n):
    f = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять',
         6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять'}
    o = {10: 'десять', 20: 'двадцать', 30: 'тридцать', 40: 'сорок',
         50: 'пятьдесят', 60: 'шестьдесят', 70: 'семьдесят',
         80: 'восемьдесят', 90: 'девяносто'}
    s = {11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать',
         14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать',
         17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать'}
    ll = {100: 'сто', 200: 'двести', 300: 'триста', 400: 'четыреста',
         500: 'пятьсот', 600: 'шестьсот', 700: 'семьсот',
         800: 'восемьсот', 900: 'девятьсот'}

    n1 = n % 10  #последний
    n2 = n % 100 #средний с последним
    n3 = n / 100 #первый
    npepeg = n - n1 #средний разряд
    npepegbigger = n2 - n1 #средний разряд трехциферного буквы
    nbig = n - n2

    if n < 10:
        return f.get(n)
    elif 10 < n < 20:
        return s.get(n)
    elif n >= 10 and n in o:
        return o.get(n)
    elif n >= 100 and n in ll:
        return ll.get(n)
    elif n < 100:
        return o.get(npepeg) + ' ' + f.get(n1)
    elif n >= 100 and (n < 1000) and n2 in s:
        return ll.get(nbig) + ' ' + s.get(n2)
    elif n >= 100 and (n < 1000) and n2 in o:
        return ll.get(nbig) + ' ' + o.get(npepegbigger)
    elif n >= 100 and (n < 1000) and n2 not in s:
        return ll.get(nbig) + ' ' + o.get(npepegbigger) + ' ' + f.get(n1)


print("Введите число")
a = int(input())
print(number_to_words(a))
